cask_args appdir: "/Applications"

tap "caskroom/cask"

brew "ack"
brew "awscli"
brew "bash-completion"
brew "bash-git-prompt"
brew "brew-cask"
brew "cabal-install"
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "docker-swarm"
brew "emacs"
brew "ghc"
brew "git"
brew "go"
brew "haskell-stack"
brew "hugo"
brew "htop"
brew "openssl"
brew "n"
brew "ruby-build"
brew "rbenv"
brew "unrar"
brew "sbt"
brew "scala"
brew "typesafe-activator"
brew "wget"

cask "1password"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "karabiner"
cask "transmission"
cask "virtualbox"