cask_args appdir: "/Applications"

tap "caskroom/cask"

cask "atom"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "java"
cask "jdownloader"
cask "karabiner"
cask "transmission"
cask "virtualbox"
cask "vlc"

cask "vagrant"

brew "ack"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "brew-cask"
brew "cabal-install"
brew "coreutils"
brew "emacs"
brew "ghc"
brew "git"
brew "go"
brew "gradle"
brew "haskell-stack"
brew "hugo"
brew "htop-osx"
brew "httping"
brew "jq"
brew "leiningen"
brew "maven"
brew "n"
brew "openssl"
brew "p7zip"
brew "ruby-build"
brew "rbenv"
brew "unrar"
brew "sbt"
brew "scala"
brew "the_silver_searcher"
brew "thefuck"
brew "tree"
brew "tmux"
brew "typesafe-activator"
brew "terraform"
brew "unrar"
brew "weechat"
brew "wget"