cask_args appdir: "/Applications"
tap "homebrew/cask"

cask "java" unless system "/usr/libexec/java_home --failfast"

brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "cabal-install"
brew "coreutils"
brew "curl"
brew "elixir"
brew "emacs"
brew "ghc"
brew "git"
brew "go"
brew "gradle"
brew "haskell-stack"
brew "hugo"
brew "htop-osx"
brew "jq"
brew "maven"
brew "openssl"
brew "packer"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "rbenv"
brew "ripgrep"
brew "unrar"
brew "sbt"
brew "scala"
brew "thefuck"
brew "tree"
brew "tmux"
brew "terraform"
brew "unrar"
brew "watch"
brew "wget"